
Функция ДополнитьСписокПроксиСfreeproxylistИспользуяБесплатныйАПИ() Экспорт
	
	//https://www.freeproxy-list.ru/api/proxy?anonymity=false&token=demo

	Сервер = "freeproxy-list.ru";
	Ресурс = "api/proxy?anonymity=false&token=demo"; 				
	
	Соединение = Новый HTTPСоединение(Сервер,,,,,,Новый ЗащищенноеСоединениеOpenSSL); 
	Запрос = Новый HTTPЗапрос(Ресурс);
    Запрос.Заголовки.Вставить("Connection", "keep-alive"); 
    Запрос.Заголовки.Вставить("Content-Type", "multipart/form-data;");       
    
	Ответ = Соединение.Получить(Запрос);
	СтрокаСПроксиСерверами = Ответ.ПолучитьТелоКакСтроку();
	
	Для Счетчик = 1 По СтрЧислоСтрок(СтрокаСПроксиСерверами) Цикл
   		ТекСтрока = СтрПолучитьСтроку(СтрокаСПроксиСерверами, Счетчик);
		ПозицияРазделителя = СтрНайти(ТекСтрока, ":"); 
		АдресПрокси = Лев(ТекСтрока, ПозицияРазделителя - 1); 
		НомерПорта = Число(Сред(ТекСтрока, ПозицияРазделителя + 1));
		 
		Если НомерПорта = 80 или НомерПорта = 8080 Тогда 
			
			ЗапросПрокси = Новый Запрос();
			ЗапросПрокси.Текст = "ВЫБРАТЬ
			                     |	ПроксиСервера.Ссылка КАК Ссылка
			                     |ИЗ
			                     |	Справочник.ПроксиСервера КАК ПроксиСервера
			                     |ГДЕ
			                     |	ПроксиСервера.АдресПроксиСервера = &АдресПроксиСервера
			                     |	И ПроксиСервера.ПортПроксиСервера = &ПортПроксиСервера";
			ЗапросПрокси.УстановитьПараметр("АдресПроксиСервера", АдресПрокси);
			ЗапросПрокси.УстановитьПараметр("ПортПроксиСервера", НомерПорта);

			Если ЗапросПрокси.Выполнить().Пустой() Тогда // Добавим новый прокси в нашу базу
				НовыйПрокси = Справочники.ПроксиСервера.СоздатьЭлемент();
				НовыйПрокси.Наименование = АдресПрокси; 
				НовыйПрокси.АдресПроксиСервера = АдресПрокси;
				НовыйПрокси.ПортПроксиСервера = НомерПорта;
				НовыйПрокси.Протокол = "https";
				НовыйПрокси.Актуален = Истина;
				НовыйПрокси.МожноИспользовать = Истина;
				НовыйПрокси.ПриоритетИспользования = 300;
				НовыйПрокси.Записать();				
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	
КонецФункции



Функция ДополнитьСписокПроксиСspysИспользуяБесплатныйАПИ() Экспорт
	
	//http://spys.me/proxy.txt

	Сервер = "spys.me";
	Ресурс = "proxy.txt"; 				
	
	Соединение = Новый HTTPСоединение(Сервер,,,,,,); 
	Запрос = Новый HTTPЗапрос(Ресурс);
    Запрос.Заголовки.Вставить("Connection", "keep-alive"); 
    Запрос.Заголовки.Вставить("Content-Type", "multipart/form-data;");       
    
	Ответ = Соединение.Получить(Запрос);
	СтрокаСПроксиСерверами = Ответ.ПолучитьТелоКакСтроку();
	
	Для Счетчик = 10 По СтрЧислоСтрок(СтрокаСПроксиСерверами) Цикл
   		ТекСтрока = СтрПолучитьСтроку(СтрокаСПроксиСерверами, Счетчик);   
		Если Не ЗначениеЗаполнено(ТекСтрока) Тогда 
			Прервать;
		КонецЕсли;
		ПозицияРазделителя = СтрНайти(ТекСтрока, ":");
		ПозицияПробела = СтрНайти(ТекСтрока, " ");
		АдресПрокси = Лев(ТекСтрока, ПозицияРазделителя - 1); 
		НомерПорта = Число(Сред(ТекСтрока, ПозицияРазделителя + 1, ПозицияПробела - ПозицияРазделителя));
		Страна = Сред(ТекСтрока, ПозицияПробела + 1, 2); 
		Если СтрНайти(ТекСтрока, "S") > 0 И СтрНайти(ТекСтрока, "H") > 0 Тогда 
			
			ЗапросПрокси = Новый Запрос();
			ЗапросПрокси.Текст = "ВЫБРАТЬ
			                     |	ПроксиСервера.Ссылка КАК Ссылка
			                     |ИЗ
			                     |	Справочник.ПроксиСервера КАК ПроксиСервера
			                     |ГДЕ
			                     |	ПроксиСервера.АдресПроксиСервера = &АдресПроксиСервера
			                     |	И ПроксиСервера.ПортПроксиСервера = &ПортПроксиСервера";
			ЗапросПрокси.УстановитьПараметр("АдресПроксиСервера", АдресПрокси);
			ЗапросПрокси.УстановитьПараметр("ПортПроксиСервера", НомерПорта);

			Если ЗапросПрокси.Выполнить().Пустой() Тогда // Добавим новый прокси в нашу базу
				НовыйПрокси = Справочники.ПроксиСервера.СоздатьЭлемент();
				НовыйПрокси.Наименование = АдресПрокси; 
				НовыйПрокси.АдресПроксиСервера = АдресПрокси;
				НовыйПрокси.ПортПроксиСервера = НомерПорта;
				НовыйПрокси.Протокол = "https";
				НовыйПрокси.Актуален = Истина;
				НовыйПрокси.МожноИспользовать = Истина;
				НовыйПрокси.ПриоритетИспользования = 300;
				НовыйПрокси.Страна = Страна;
				НовыйПрокси.Записать();				
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	
КонецФункции
