
Процедура ПередЗаписью(Отказ)
		
	//Првоерим уникальность реквизита Шаблон
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТелеграмОбработкаЧёткиеШаблоныСообщений.Ссылка
	               |ИЗ
	               |	Справочник.ТелеграмОбработкаЧёткиеШаблоныСообщений КАК ТелеграмОбработкаЧёткиеШаблоныСообщений
	               |ГДЕ
	               |	ТелеграмОбработкаЧёткиеШаблоныСообщений.Шаблон = &Шаблон
	               |	И ТелеграмОбработкаЧёткиеШаблоныСообщений.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Шаблон", нРег(Шаблон));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		Отказ = Истина;	
		Сообщить("Значение Шаблон не уникально");
	КонецЕсли;
	
КонецПроцедуры
