
Функция ПолучитьПоследнийДокументПоИДРедактируемогоСообщения(ИДРедактируемогоСообщения) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ТелеграмСообщенияИсходящие.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ТелеграмСообщенияИсходящие КАК ТелеграмСообщенияИсходящие
	               |ГДЕ
	               |	ТелеграмСообщенияИсходящие.ИДРедактируемогоСообщения = &ИДРедактируемогоСообщения
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТелеграмСообщенияИсходящие.Дата УБЫВ,
	               |	ТелеграмСообщенияИсходящие.Номер УБЫВ";
	Запрос.УстановитьПараметр("ИДРедактируемогоСообщения", ИДРедактируемогоСообщения);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;	
	КонецЕсли;	
	
КонецФункции
