
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОбработкаКомандыНаСервере(ТипЗнч(ПараметрКоманды[0]));
	 
КонецПроцедуры

&НаСервере
Процедура ОбработкаКомандыНаСервере(ТипСправочника)
	
	Справочник = Справочники[Метаданные.НайтиПоТипу(ТипСправочника).Имя];
	
	ТекущийКод = Метаданные.НайтиПоТипу(ТипСправочника).ПолучитьИменаПредопределенных().Количество();
	
	//Освобождаем коды
	ВыборкаЭлементов = Справочник.Выбрать();	
	МаксимальныйКод = 999999999;	
	Пока ВыборкаЭлементов.Следующий() Цикл
		Если НЕ ВыборкаЭлементов.Предопределенный Тогда 
			Элемент = ВыборкаЭлементов.ПолучитьОбъект();	
			Элемент.Код = МаксимальныйКод;
			Элемент.Записать();		
			МаксимальныйКод = МаксимальныйКод - 1;
		КонецЕсли;	
	КонецЦикла;	
	
	//Перенумерация
	ВыборкаЭлементов = Справочник.Выбрать();
	Пока ВыборкаЭлементов.Следующий() Цикл
		Если НЕ ВыборкаЭлементов.Предопределенный Тогда 
			ТекущийКод = ТекущийКод + 1;
			Элемент = ВыборкаЭлементов.ПолучитьОбъект();	
			Элемент.Код = ТекущийКод;
			Элемент.Записать();		
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

