
Процедура ПередЗаписью(Отказ)
	
	//Првоерим уникальность HTTPName если оно заполнено
	
	Если ЗначениеЗаполнено(HTTPName) Тогда
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	СобытияHTTP.Ссылка
		               |ИЗ
		               |	Справочник.СобытияHTTP КАК СобытияHTTP
		               |ГДЕ
		               |	СобытияHTTP.HTTPName = &HTTPName
		               |	И СобытияHTTP.Ссылка <> &Ссылка";
		Запрос.УстановитьПараметр("HTTPName", HTTPName);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			Отказ = Истина;	
			Сообщить("Значение HTTPName не уникально");
		КонецЕсли;	
	КонецЕсли;
		
КонецПроцедуры
