
Процедура ПередЗаписью(Отказ)
	//Првоерим уникальность IP адреса если он заполнен
	
	Если ЗначениеЗаполнено(IPАдрес) Тогда
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	IPУстройства.Ссылка
		               |ИЗ
		               |	Справочник.IPУстройства КАК IPУстройства
		               |ГДЕ
		               |	IPУстройства.IPАдрес = &IPАдрес
		               |	И IPУстройства.Ссылка <> &Ссылка";
		Запрос.УстановитьПараметр("IPАдрес", IPАдрес);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			Отказ = Истина;	
			Сообщить("Значение IPАдрес не уникально");
		КонецЕсли;	
	КонецЕсли;
		
КонецПроцедуры
