
Функция СформироватьИнтерфейс(ЭлементСправочника, ПараметрыЗапроса) Экспорт
	//Параметры - соответствие из запроса	
	
	Ответ = "";
	
	Если ЭлементСправочника.Активно Тогда  
	
		ТекстПолученияПеременных = "";
		МассивЗначенийПеременных = Новый Массив();
		н = -1;
		Для Каждого СтрокаПеременной Из ЭлементСправочника.HTMLБлоки Цикл
			н = н + 1;
			ТекстПолученияПеременных = ТекстПолученияПеременных + СтрокаПеременной.ИмяПеременной + " = "
			+ "МассивЗначенийПеременных[" + н + "];" + Символы.ПС;
			МассивЗначенийПеременных.Добавить(СтрокаПеременной.HTMLКод);		
		КонецЦикла;
		Для Каждого СтрокаПеременной Из ЭлементСправочника.ПеременныеДляПроцедуры Цикл
			н = н + 1;
			ТекстПолученияПеременных = ТекстПолученияПеременных + СтрокаПеременной.ИмяПеременной + " = "
			+ "МассивЗначенийПеременных[" + н + "];" + Символы.ПС;
			МассивЗначенийПеременных.Добавить(СтрокаПеременной.Значение);		
		КонецЦикла;
		ВыполняемыйКодФормированияОтвета = ТекстПолученияПеременных +	ЭлементСправочника.КодФормированияОтвета;
		Попытка 
			Выполнить(ВыполняемыйКодФормированияОтвета);
		Исключение
			ОписаниеОшибки = "Ошибка при выполнении кода формирования ответа для Веб интерфейса " + ЭлементСправочника.URLИмя + ". Описание ошибки = " + ОписаниеОшибки(); 
			ЗаписьВЖурналОшибок("Справочники.ВебИнтерфейсы.МодульМенеджера", "СформироватьИнтерфейс", ОписаниеОшибки);
		КонецПопытки;
	
	КонецЕсли;
	
	
	Возврат Ответ;
	
КонецФункции
