
&НаСервере
Процедура СтартНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СкомпоноватьСообщенияГруппыЛинейно(ТелеграмГруппаСообщений, НазваниеГруппы); 
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура Старт(Команда)
	СтартНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьПрогрессНаСервере()
	
	ИндикаторПрогресса = РегистрыСведений.ПрогрессВыполненияСерверныхПроцедур.Получить(Новый Структура("ПолноеИмяОбработчика", "Обработки.ТелеграмКомпоновкаСообщенийГруппы.СкомпоноватьСообщенияГруппыЛинейно")).Прогресс;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПрогресс(Команда)
	ОбновитьПрогрессНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПрогрессАвтоматически()
	ОбновитьПрогрессНаСервере();
КонецПроцедуры

&НаСервере
Процедура СтартВФонеНаСервере()
	
	МассивСПараметрами = Новый Массив();
	МассивСПараметрами.Добавить(ТелеграмГруппаСообщений);
	МассивСПараметрами.Добавить(НазваниеГруппы);
	ОбщегоНазначения.ВыполнитьПроцедуруФункциюВФонеНаСервере("Обработки.ТелеграмКомпоновкаСообщенийГруппы.СкомпоноватьСообщенияГруппыЛинейно", МассивСПараметрами);

КонецПроцедуры

&НаКлиенте
Процедура СтартВФоне(Команда)
	СтартВФонеНаСервере();
	ПодключитьОбработчикОжидания("ОбновитьПрогрессАвтоматически", 1, Ложь);
КонецПроцедуры
