
&НаСервере
Процедура ДополнитьСписокПроксиНаСервереСfreeproxylist()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ДополнитьСписокПроксиСfreeproxylistИспользуяБесплатныйАПИ(); 
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьСписокПроксиСfreeproxylist(Команда)
	ДополнитьСписокПроксиНаСервереСfreeproxylist();
КонецПроцедуры

&НаСервере
Процедура ДополнитьСписокПроксиspysНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ДополнитьСписокПроксиСspysИспользуяБесплатныйАПИ(); 
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьСписокПроксиspys(Команда)
	ДополнитьСписокПроксиspysНаСервере();
КонецПроцедуры
