
//Датчик должн быть подключён к цифровому пину

Процедура ПроцессДляСервера(Процесс = "") Экспорт
	
	ИнициирующийПроцесс = Процесс;
	
	Инициализация();	
	ПолучитьДанныеСДатчика();
	 
	Если ДатаПолученияДанных <> '00010101' Тогда 
		ЗаписатьТекущееДанные();	
	КонецЕсли;

КонецПроцедуры

//////
Процедура Инициализация()
	
	Ответ = ЗаполнитьПины();
	Если ЗначениеЗаполнено(Ответ) Тогда 
		Сообщения = Сообщения + Символы.ПС + ТекущаяДата() + " " + Ответ;
	КонецЕсли;
	
КонецПроцедуры
Функция ЗаполнитьПины() 
	
	СообщениеСНенайденнымиПинами = "";
	
	СтрокаСНастройкой = Оборудование.Пины.Найти("ДатчикDHT", "Наименование");
	Если СтрокаСНастройкой = Неопределено Тогда 
		СообщениеСНенайденнымиПинами = СообщениеСНенайденнымиПинами + "Не задан ПИН для ""ДатчикDHT""; ";
	Иначе
		НомерПина = СтрокаСНастройкой.НомерПина;
	КонецЕсли;
	
	Возврат СообщениеСНенайденнымиПинами;
	
КонецФункции


Процедура ПолучитьДанныеСДатчика()
	
	Ответ = К._ТемператураВлажностьDHT21(Оборудование, НомерПина); 

	Если ТипЗнч(Ответ) = Тип("Структура") Тогда 
		ТекущаяТемпература = Ответ.Температура;
		ТекущаяВлажность = Ответ.Влажность;
		ДатаПолученияДанных = ТекущаяДата();
	Иначе
		Сообщения = Сообщения + Символы.ПС + ТекущаяДата() + "Не удалось получить данные температуры и влажности";
	КонецЕсли;	
	
КонецПроцедуры
/////	

Процедура ЗаписатьТекущееДанные()
	
	ОбщегоНазначения.ЗаписатьДанныеОборудования(Оборудование, "Температура", ТекущаяТемпература, ДатаПолученияДанных); 
	ОбщегоНазначения.ЗаписатьДанныеОборудования(Оборудование, "Влажность", ТекущаяВлажность, ДатаПолученияДанных); 	
	
КонецПроцедуры

