
Процедура ФоновыйПроцессТрансляцииКамеры(ТелеграмКонтакт) Экспорт //ОбновляетФотографию
	
	NativeS = К.NativeПодключитьКомпоненту();	  // Для управления задержкой
	Если NativeS = Неопределено Тогда 
		ЗаписьВЖурналОшибок("Обработки.ТелеграмИИТрансляцияКамеры", "ФоновыйПроцессТрансляцииКамеры", "Не удалось подключить компоненту Native.");
		Возврат;
	КонецЕсли;

	
	Пока Истина Цикл
		МенеджерЗаписи = РегистрыСведений.ТелеграмОбработкаСообщенийИИАктивные.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ТелеграмКонтакт = ТелеграмКонтакт;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.РасположениеПроцедуры = "Обработки.ТелеграмИИТрансляцияКамеры" И МенеджерЗаписи.НазваниеПроцедуры = "ПроцедураДляВызова"  Тогда
			ТекущиеДанные = МенеджерЗаписи.ТекущиеДанные.Получить();
			Если ТекущиеДанные.Транслировать = Истина Тогда	
				// Повторяем отправку новой картинке после того как убедимся в окончании отправки старой
				
				ИДГлавногоСообщения = РегистрыСведений.ТелеграмСообщенияИсходящиеОтправленные.Получить(Новый Структура("Сообщение", ТекущиеДанные.ИсхСообщениеТрансляции)).СообщениеИД;
					 
				Если ЗначениеЗаполнено(ИДГлавногоСообщения) Тогда
					Если ТекущиеДанные.Свойство("СсылкаНаДокСообщениеИсхКорректировочное") Тогда
						ПоследнееОтправленноеСообщение = ТекущиеДанные.СсылкаНаДокСообщениеИсхКорректировочное;
					Иначе
						ПоследнееОтправленноеСообщение = ТекущиеДанные.ИсхСообщениеТрансляции;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(РегистрыСведений.ТелеграмСообщенияИсходящиеОтправленные.Получить(Новый Структура("Сообщение", ПоследнееОтправленноеСообщение)).СообщениеИД) Тогда
					//ПоследнееСообщение было отправлено, можно отправлять следующее
					
						ОбщегоНазначения.ЗаписатьДанныеОборудования(ТекущиеДанные.Камера, "Транслировать", 1, ТекущаяДата());

						ЗаписьРегистра = РегистрыСведений.ТекущиеДанныеОборудования.Получить(Новый Структура("Оборудование, ОбъектДанных", ТекущиеДанные.Камера, "Трансляция"));
						Если ТекущиеДанные.ДатаПоследнегоОтправленногоСнимка <> ЗаписьРегистра.Дата Тогда // Удостоверимся что фотография обновлена, отправка чаще раза в сек всё равно невозможна 
							ДвоичныйДанныеФотографии = ЗаписьРегистра.Хранилище.Получить();
							ФотоСКамеры = Новый Картинка(ДвоичныйДанныеФотографии);
							ПолныйПутьКФайлуСФото = ПолучитьИмяВременногоФайла("jpg");
							ФотоСКамеры.Записать(ПолныйПутьКФайлуСФото);
							Если ФотоСКамеры.РазмерФайла() >= 100 Тогда // Если изображение меньше 100 байт тогда считаем что файл пустой								
								Сообщение = Новый Структура();
								Сообщение.Вставить("ТелеграмКонтакт", ТелеграмКонтакт);
								Сообщение.Вставить("ФайлПуть", ПолныйПутьКФайлуСФото);
								Сообщение.Вставить("ФайлТип", "photo");				
								Сообщение.Вставить("ИДРедактируемогоСообщения", ИДГлавногоСообщения);
								СсылкаНаДокСообщениеИсхКорректировочное = ТелеграмМодуль.СоздатьИОтправитьДокСообщениеИсходящие(Сообщение);
								
								ТекущиеДанные.ДатаПоследнегоОтправленногоСнимка = ЗаписьРегистра.Дата; 
								ТекущиеДанные.Вставить("СсылкаНаДокСообщениеИсхКорректировочное", СсылкаНаДокСообщениеИсхКорректировочное);
								
								МенеджерЗаписи.ТекущиеДанные = Новый ХранилищеЗначения(ТекущиеДанные);
								МенеджерЗаписи.ДатаЗаписи = ТекущаяДата();
								МенеджерЗаписи.Записать(Истина);
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;		
				КонецЕсли;
			Иначе
				Прервать; // Трансляция выключена	
			КонецЕсли;
		Иначе
			Прервать; // ИИ был выключен
		КонецЕсли;
		NativeS.Задержка(500);
	КонецЦикла;	
	
	
		
			
	
КонецПроцедуры

