
Процедура ПроцедураДляВызова(СсылкаДокВхСообщение) Экспорт

	ПозицияАдресаБота = СтрНайти(СсылкаДокВхСообщение.Текст, Справочники.ТелеграмПараметры.АдресБота.Значение);
	Если ПозицияАдресаБота > 0 Тогда
		ТекстСообщения = Лев(СсылкаДокВхСообщение.Текст, ПозицияАдресаБота-1);
	Иначе
		ТекстСообщения = СсылкаДокВхСообщение.Текст;
	КонецЕсли;

	МенеджерЗаписи = РегистрыСведений.ТелеграмОбработкаСообщенийИИАктивные.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ТелеграмКонтакт = СсылкаДокВхСообщение.ТелеграмКонтакт;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.РасположениеПроцедуры <> "Обработки.ТелеграмИИТрансляцияКамеры" или МенеджерЗаписи.НазваниеПроцедуры <> "ПроцедураДляВызова"  Тогда
		//Это первая итерация
		МенеджерЗаписи.ТелеграмКонтакт = СсылкаДокВхСообщение.ТелеграмКонтакт;
		МенеджерЗаписи.РасположениеПроцедуры = "Обработки.ТелеграмИИТрансляцияКамеры";
		МенеджерЗаписи.НазваниеПроцедуры = "ПроцедураДляВызова";
		ТекущиеДанные = Новый Структура();
		ТекущиеДанные.Вставить("КолВыполненныхИтераций", 1);
		ТекущиеДанные.Вставить("ОжидаемыйТипОтветаПользователя", "НомерВыбраннойКамеры");
		ТекущиеДанные.Вставить("Камера", Неопределено);
		ТекущиеДанные.Вставить("Транслировать", Ложь);
		мКамеры = Новый Массив();
		
		Текст = "Выберите камеру:";
		
		н = 0;
		Для Каждого КарточкаКамеры Из Справочники.Настройки.СписокКамер.ТаблицаНастроек Цикл
			н = н + 1;
			ОборудованиеКамера = КарточкаКамеры.Значение;	
			мКамеры.Добавить(ОборудованиеКамера);
			Текст = Текст + Символы.ПС + "/" + Формат(н,"ЧГ=") + " " + ОборудованиеКамера.Наименование; 
		КонецЦикла;
		
		ТекущиеДанные.Вставить("мКамеры", мКамеры);
		
		МенеджерЗаписи.ТекущиеДанные = Новый ХранилищеЗначения(ТекущиеДанные);
		МенеджерЗаписи.ДатаЗаписи = ТекущаяДата();
		МенеджерЗаписи.Записать(Истина);		
		
		Сообщение = Новый Структура();
		Сообщение.Вставить("ТелеграмКонтакт", СсылкаДокВхСообщение.ТелеграмКонтакт);
		Сообщение.Вставить("Текст", Текст);
		ТелеграмМодуль.СоздатьИОтправитьДокСообщениеИсходящие(Сообщение);
		
	Иначе
		ТекущиеДанные = МенеджерЗаписи.ТекущиеДанные.Получить();
		ТекущиеДанные.КолВыполненныхИтераций = ТекущиеДанные.КолВыполненныхИтераций + 1;

		Если ТекущиеДанные.ОжидаемыйТипОтветаПользователя = "НомерВыбраннойКамеры" Тогда
			ТекРазмерФайла = 0;
			Пока ТекРазмерФайла < 100 Цикл  // Если изображение меньше 100 байт тогда считаем что файл пустой
				КамераОборудование = ТекущиеДанные.мКамеры.Получить(Число(Сред(ТекстСообщения, 2)) - 1);
				УправлениеОборудованием.ПолучитьФотоСКамерыИПоместитьЕгоВРегистрТекущиеДанныеОборудования(КамераОборудование);
				ЗаписьРегистра = РегистрыСведений.ТекущиеДанныеОборудования.Получить(Новый Структура("Оборудование, ОбъектДанных", КамераОборудование, "Трансляция"));
				ДвоичныйДанныеФотографии = ЗаписьРегистра.Хранилище.Получить();
				ФотоСКамеры = Новый Картинка(ДвоичныйДанныеФотографии);
				ПолныйПутьКФайлуСФото = ПолучитьИмяВременногоФайла("jpg");
				ФотоСКамеры.Записать(ПолныйПутьКФайлуСФото);
				ТекРазмерФайла = ФотоСКамеры.РазмерФайла();
			КонецЦикла;								
								
			ТекущиеДанные.Вставить("ДатаПоследнегоОтправленногоСнимка", ЗаписьРегистра.Дата);
			ТекущиеДанные.Вставить("ОжидаемыйТипОтветаПользователя", "НомерВыбраннойКамеры");
			ТекущиеДанные.Вставить("Камера", КамераОборудование);
			ТекущиеДанные.Вставить("Транслировать", Истина);
			
			Сообщение = Новый Структура();
			Сообщение.Вставить("ТелеграмКонтакт", СсылкаДокВхСообщение.ТелеграмКонтакт);
			Сообщение.Вставить("ФайлПуть", ПолныйПутьКФайлуСФото);
			Сообщение.Вставить("ФайлТип", "photo");
			СсылкаНаДокСообщениеИсх = ТелеграмМодуль.СоздатьИОтправитьДокСообщениеИсходящие(Сообщение);
			
			ТекущиеДанные.Вставить("ИсхСообщениеТрансляции", СсылкаНаДокСообщениеИсх);
			
			МенеджерЗаписи.ТекущиеДанные = Новый ХранилищеЗначения(ТекущиеДанные);
			МенеджерЗаписи.ДатаЗаписи = ТекущаяДата();
			МенеджерЗаписи.Записать(Истина);
			
			мПараметры = Новый Массив();
			мПараметры.Добавить(СсылкаДокВхСообщение.ТелеграмКонтакт);
			ОбщегоНазначения.ВыполнитьПроцедуруФункциюВФонеНаСервере("Обработки.ТелеграмИИТрансляцияКамеры.ФоновыйПроцессТрансляцииКамеры", мПараметры);
		КонецЕсли;
	
		
	КонецЕсли;

	
КонецПроцедуры


//Продолжение в модуле менеджера

