

Функция Get(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "text/html");
	
	URLИмя = Сред(Запрос.ОтносительныйURL, 2);

	Если ЗначениеЗаполнено(URLИмя) Тогда // Пустое имя недопустимо
		ВебИнтерфейс = Справочники.ВебИнтерфейсы.НайтиПоРеквизиту("URLИмя", URLИмя);
		Если ЗначениеЗаполнено(ВебИнтерфейс) Тогда		
			ТелоОтвета = Справочники.ВебИнтерфейсы.СформироватьИнтерфейс(ВебИнтерфейс, Запрос.ПараметрыЗапроса);		
			Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
		КонецЕсли;
	КонецЕсли;

	
	Возврат Ответ;
	
КонецФункции

