
&НаСервере
Процедура ВключитьВыключитьНаСервере()
	
	Если ТипЗнч(Элементы.ДинамическийСписок.ТекущаяСтрока) = Тип("РегистрСведенийКлючЗаписи.Процессы") Тогда
		МенеджерЗаписи = РегистрыСведений.Процессы.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Наименование = Элементы.ДинамическийСписок.ТекущаяСтрока.Наименование;
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.Наименование = Элементы.ДинамическийСписок.ТекущаяСтрока.Наименование;
		МенеджерЗаписи.Включён = НЕ МенеджерЗаписи.Включён;
		МенеджерЗаписи.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьВыключить(Команда)
	ВключитьВыключитьНаСервере();
	Элементы.ДинамическийСписок.Обновить();
КонецПроцедуры
