
Процедура ПроцессДляСервера(Процесс = "") Экспорт // Записывается в процессы НазваниеПроцедуры
	
	Инициализация();		
	ОтправитьКомандуУвеличенияВремени();	
	
КонецПроцедуры

Процедура Инициализация()Экспорт
		
	Ответ = ЗаполнитьНастройки();
	Если ЗначениеЗаполнено(Ответ) Тогда 
		Сообщения = Сообщения + Символы.ПС + ТекущаяДата() + " " + Ответ;
	КонецЕсли;
	
КонецПроцедуры

Функция  ЗаполнитьНастройки() Экспорт
	
	СообщениеСНенайденнымиНастройками = "";
	
	// Настройки в реквизитах
	СтрокаСТабСНастройкамиРеквизитов = Оборудование.Настройки.Найти("Реквизиты",  "Наименование");
	Если СтрокаСТабСНастройкамиРеквизитов = Неопределено Тогда 
		СообщениеСНенайденнымиНастройками = СообщениеСНенайденнымиНастройками + "Не заполнена настройка для реквизитов ""Реквизиты"" (В справочнике оборудование); ";
	Иначе
		ТабСНастройкамиРеквизитов = СтрокаСТабСНастройкамиРеквизитов.Настройка.ТаблицаНастроек;
		
		СтрокаСПараметром = ТабСНастройкамиРеквизитов.Найти("ВремяДоТаймаута", "Параметр");
		Если СтрокаСПараметром = Неопределено Тогда 
			СообщениеСНенайденнымиНастройками = СообщениеСНенайденнымиНастройками + "Не указан параметр ""ВремяДоТаймаута""; ";
		Иначе
			ВремяДоТаймаута = СтрокаСПараметром.Значение;
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат СообщениеСНенайденнымиНастройками;


КонецФункции

Процедура ОтправитьКомандуУвеличенияВремени()Экспорт

	Ответ = К.АвтоСброс(Оборудование, ВремяДоТаймаута); 
	
КонецПроцедуры
