
Процедура ОбновитьДанныеСОборудования(Оборудование, ОбъектДанных) Экспорт

	ЗаписьМеханизма = РегистрыСведений.ТекущиеДанныеОборудованияМеханизмыПолучения.Получить(Новый Структура("Оборудование, ОбъектДанных", Оборудование, ОбъектДанных));
	
	Если ЗаписьМеханизма.Активен = Истина Тогда 
		Если ТипЗнч(ЗаписьМеханизма.Механизм) = Тип("СправочникСсылка.Действия") Тогда
			МассивСДействиями = Новый Массив();
			МассивСДействиями.Добавить(ЗаписьМеханизма.Механизм);
			Справочники.Действия.ВыполнитьДействия(МассивСДействиями);
		Иначе
			//Дописать варианты
		КонецЕсли;
		
	КонецЕсли;	

КонецПроцедуры

Процедура ПолучитьФотоСКамерыИПоместитьЕгоВРегистрТекущиеДанныеОборудования(Оборудование) Экспорт
	
		//Получаем настройки
////////////////////////////////////////////////
	СтрокаСТабСНастройкамиМеханизма = Оборудование.Настройки.Найти("МеханизмПолученияФото",  "Наименование");
	
	
	Если СтрокаСТабСНастройкамиМеханизма = Неопределено Тогда 
		ЗаписьВЖурналОшибок("УправлениеОборудованием", "ПолучитьФотоСКамерыИПоместитьЕгоВоВременноеХранилище", "Не заполнена настройка ""МеханизмПолученияФото"" (В справочнике оборудование)");
	Иначе
		ТабСНастройкамиМеханизма = СтрокаСТабСНастройкамиМеханизма.Настройка.ТаблицаНастроек;
		///////////////////		
		СтрокаСПараметром = ТабСНастройкамиМеханизма.Найти("РасположениеПроцедуры", "Параметр");
		Если СтрокаСПараметром = Неопределено Тогда 
			ЗаписьВЖурналОшибок("УправлениеОборудованием", "ПолучитьФотоСКамерыИПоместитьЕгоВоВременноеХранилище", "Не указан параметр ""РасположениеПроцедуры""");
		Иначе
			РасположениеПроцедуры = СтрокаСПараметром.Значение;			
		КонецЕсли;
		///////////////
		СтрокаСПараметром = ТабСНастройкамиМеханизма.Найти("НазваниеПроцедуры", "Параметр");
		Если СтрокаСПараметром = Неопределено Тогда 
			ЗаписьВЖурналОшибок("УправлениеОборудованием", "ПолучитьФотоСКамерыИПоместитьЕгоВоВременноеХранилище", "Не указан параметр ""НазваниеПроцедуры""");		Иначе
			НазваниеПроцедуры = СтрокаСПараметром.Значение;			
		КонецЕсли;
	КонецЕсли;
	
	
	//Составляем код для получения Фото
////////////////////////////////////////////////	

	Если ТипЗнч(РасположениеПроцедуры) = Тип("Строка") И СтрНайти(СокрЛ(РасположениеПроцедуры), "Обработки") = 1 Тогда // Это встроенная обработка
		КодВыполнения = "Обработка = " + СокрЛП(РасположениеПроцедуры) + ".Создать();
		|Обработка.Оборудование = Оборудование;
		|ДвоичныеДанныеФотографии = Обработка." + СокрЛП(НазваниеПроцедуры) + "();";		
	Иначе
		/// можно дописать
		КодВыполнения = "ДвоичныеДанныеФотографии = Неопределено";
	КонецЕсли;
	
	//Получаем Фото и помещаем его во врем хранилище
//////////////////////////////////////////////////		
	ДвоичныеДанныеФотографии = Неопределено;
	Попытка
		Выполнить(КодВыполнения);
	Исключение
		ЗаписьВЖурналОшибок("УправлениеОборудованием", "ПолучитьФотоСКамерыИПоместитьЕгоВоВременноеХранилище", "Не удалось выполнить КодВыполнения. Описание ошибки: " + ОписаниеОшибки());
		ДвоичныеДанныеФотографии = Неопределено;	
	КонецПопытки;
	
	ОбщегоНазначения.ЗаписатьДанныеОборудования(Оборудование, "Трансляция", 1, ТекущаяДата(), Новый ХранилищеЗначения(ДвоичныеДанныеФотографии)); 
	
КонецПроцедуры

Процедура ТрансляцияКамеры(Оборудование) Экспорт
	
		//Получаем настройки
////////////////////////////////////////////////
	СтрокаСТабСНастройкамиМеханизма = Оборудование.Настройки.Найти("МеханизмПолученияФото",  "Наименование");
		
	Если СтрокаСТабСНастройкамиМеханизма = Неопределено Тогда 
		ЗаписьВЖурналОшибок("УправлениеОборудованием", "ПолучитьФотоСКамерыИПоместитьЕгоВоВременноеХранилище", "Не заполнена настройка ""МеханизмПолученияФото"" (В справочнике оборудование)");
	Иначе
		ТабСНастройкамиМеханизма = СтрокаСТабСНастройкамиМеханизма.Настройка.ТаблицаНастроек;
		///////////////////		
		СтрокаСПараметром = ТабСНастройкамиМеханизма.Найти("РасположениеПроцедуры", "Параметр");
		Если СтрокаСПараметром = Неопределено Тогда 
			ЗаписьВЖурналОшибок("УправлениеОборудованием", "ПолучитьФотоСКамерыИПоместитьЕгоВоВременноеХранилище", "Не указан параметр ""РасположениеПроцедуры""");
		Иначе
			РасположениеПроцедуры = СтрокаСПараметром.Значение;			
		КонецЕсли;
		///////////////
		СтрокаСПараметром = ТабСНастройкамиМеханизма.Найти("НазваниеПроцедуры", "Параметр");
		Если СтрокаСПараметром = Неопределено Тогда 
			ЗаписьВЖурналОшибок("УправлениеОборудованием", "ПолучитьФотоСКамерыИПоместитьЕгоВоВременноеХранилище", "Не указан параметр ""НазваниеПроцедуры""");
		Иначе
			НазваниеПроцедуры = СтрокаСПараметром.Значение;			
		КонецЕсли;
	КонецЕсли;
	
	
	//Составляем код для создания обработки
////////////////////////////////////////////////	

	Если ТипЗнч(РасположениеПроцедуры) = Тип("Строка") И СтрНайти(СокрЛ(РасположениеПроцедуры), "Обработки") = 1 Тогда // Это встроенная обработка
		КодВыполнения = "Обработка = " + СокрЛП(РасположениеПроцедуры) + ".Создать();
		|Обработка.Оборудование = Оборудование;";		
	Иначе
		/// можно дописать
	КонецЕсли;

	//Создаём обработку
	Обработка = Неопределено;
	Попытка
		Выполнить(КодВыполнения);
	Исключение
		ЗаписьВЖурналОшибок("УправлениеОборудованием", "ТрансляцияКамеры", "Не удалось создать обработку. Описание ошибки: " + ОписаниеОшибки());
	КонецПопытки;

	Если Обработка <> Неопределено Тогда 
	
		//Составляем код для получения Фото
		КодВыполнения = "ДвоичныеДанныеФотографии = Обработка." + СокрЛП(НазваниеПроцедуры) + "();";							
		Отбор = Новый Структура("Оборудование, ОбъектДанных", Оборудование, "Транслировать");
		NativeS = К.NativeПодключитьКомпоненту();	  // Для управления задержкой
		Если NativeS = Неопределено Тогда 
			ЗаписьВЖурналОшибок("УправлениеОборудованием", "ТрансляцияКамеры", "Не удалось подключить компоненту Native.");
			Возврат;
		КонецЕсли;
		
		Пока РегистрыСведений.ТекущиеДанныеОборудования.Получить(Отбор).Дата + 10 >= ТекущаяДата() Цикл // Транслируем в течении 10 сек после последней команды транслировать (Запроса на трансляцию)
			Попытка
				Выполнить(КодВыполнения);
			Исключение
				ЗаписьВЖурналОшибок("УправлениеОборудованием", "ТрансляцияКамеры", "Не удалось получить фотографию. Описание ошибки: " + ОписаниеОшибки());
				ДвоичныеДанныеФотографии = Неопределено;	
			КонецПопытки;
			
			Если ДвоичныеДанныеФотографии <> Неопределено Тогда 
				ОбщегоНазначения.ЗаписатьДанныеОборудования(Оборудование, "Трансляция", 1, ТекущаяДата(), Новый ХранилищеЗначения(ДвоичныеДанныеФотографии));  
			КонецЕсли;
			NativeS.Задержка(300);
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры
