
Функция Get(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "text/html");
	
	HTTPName = Запрос.ПараметрыЗапроса.Получить("HTTPName");
	Если ЗначениеЗаполнено(HTTPName) Тогда // Пустое значение параметра недопустимо
		СобытиеHTTP = Справочники.СобытияHTTP.НайтиПоРеквизиту("HTTPName", HTTPName);
		Если ЗначениеЗаполнено(СобытиеHTTP) Тогда		
			ТелоОтвета = Справочники.СобытияHTTP.ОбработатьСобытие(СобытиеHTTP, Запрос.ПараметрыЗапроса);		
			Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
		КонецЕсли;
	КонецЕсли;
	
	
	Возврат Ответ;
	
КонецФункции
