
//Реле должно быть подключено к цифровому пину

Процедура ПроцессДляСервераВключениеВыключениеРеле(Процесс = "") Экспорт
	
	 ИнициирующийПроцесс = Процесс;
	 
	 ИнициализацияУправлениеЧтениеРеле();	
	 ОтправитьКомандуНаРеле();
	 ДатаПолученияТекущегоСостояния = '00010101';
     ПолучитьСостояниеРеле();
	
	Если ДатаПолученияТекущегоСостояния <> '00010101' Тогда 
		ЗаписатьТекущееДанные();	
	КонецЕсли;

КонецПроцедуры

Процедура ПроцессДляСервераЧтениеФактическогоСостоянияРеле(Процесс = "") Экспорт
	
	ИнициирующийПроцесс = Процесс;
	
	ИнициализацияЧтениеСостоянияРеле();
	ДатаПолученияТекущегоСостояния = '00010101';
	ПолучитьСостояниеРеле();
	
	Если ДатаПолученияТекущегоСостояния <> '00010101' Тогда 
		ЗаписатьТекущееДанные();	
	КонецЕсли;
	
КонецПроцедуры

//////
Процедура ИнициализацияУправлениеЧтениеРеле()
	
	Ответ = ЗаполнитьПины();
	Если ЗначениеЗаполнено(Ответ) Тогда 
		Сообщения = Сообщения + Символы.ПС + ТекущаяДата() + " " + Ответ;
	КонецЕсли;

	Ответ = ЗаполнитьНастройкиУправленияРеле();
	Если ЗначениеЗаполнено(Ответ) Тогда 
		Сообщения = Сообщения + Символы.ПС + ТекущаяДата() + " " + Ответ;
	КонецЕсли;
	
КонецПроцедуры
Функция  ЗаполнитьНастройкиУправленияРеле() 
	
	СообщениеСНенайденнымиНастройками = "";
	
	// Настройки в реквизитах
	СтрокаСТабСНастройкамиРеквизитов = Оборудование.Настройки.Найти("Реквизиты",  "Наименование");
	Если СтрокаСТабСНастройкамиРеквизитов = Неопределено Тогда 
		СообщениеСНенайденнымиНастройками = СообщениеСНенайденнымиНастройками + "Не заполнена настройка для реквизитов ""Реквизиты"" (В справочнике оборудование); ";
	Иначе
		ТабСНастройкамиРеквизитов = СтрокаСТабСНастройкамиРеквизитов.Настройка.ТаблицаНастроек;
				
		СтрокаСПараметром = ТабСНастройкамиРеквизитов.Найти("ВключитьВыключитьРеле", "Параметр");
		Если СтрокаСПараметром = Неопределено Тогда 
			СообщениеСНенайденнымиНастройками = СообщениеСНенайденнымиНастройками + "Не указан параметр ""ВключитьВыключитьРеле""; ";
		Иначе
			ВключитьВыключитьРеле = СтрокаСПараметром.Значение;
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат СообщениеСНенайденнымиНастройками;

КонецФункции
Процедура ОтправитьКомандуНаРеле()
	
	К._pinModeOUTPUT_digitalWrite(Оборудование, НомерПина, ?(ВключитьВыключитьРеле, 1, 0));
	
КОнецПроцедуры

Функция ЗаполнитьПины() 
	
	СообщениеСНенайденнымиПинами = "";
	
	СтрокаСНастройкой = Оборудование.Пины.Найти("Реле", "Наименование");
	Если СтрокаСНастройкой = Неопределено Тогда 
		СообщениеСНенайденнымиПинами = СообщениеСНенайденнымиПинами + "Не задан ПИН для ""Реле""; ";
	Иначе
		НомерПина = СтрокаСНастройкой.НомерПина;
	КонецЕсли;
	
	Возврат СообщениеСНенайденнымиПинами;
	
КонецФункции

Процедура ИнициализацияЧтениеСостоянияРеле()
		
	Ответ = ЗаполнитьПины();
	Если ЗначениеЗаполнено(Ответ) Тогда 
		Сообщения = Сообщения + Символы.ПС + ТекущаяДата() + " " + Ответ;
	КонецЕсли;
	
КонецПроцедуры
Процедура ПолучитьСостояниеРеле()
	
	Ответ = К.digitalRead(Оборудование, НомерПина); 

	Если ТипЗнч(Ответ) = Тип("Число") Тогда 
		ТекущееСостояниеРеле = Ответ;
		ДатаПолученияТекущегоСостояния = ТекущаяДата();
	Иначе
		Сообщения = Сообщения + Символы.ПС + ТекущаяДата() + "Не удалось получить состояние реле";
	КонецЕсли;	
	
КонецПроцедуры
/////	

Процедура ЗаписатьТекущееДанные()
	
	ОбщегоНазначения.ЗаписатьДанныеОборудования(Оборудование, "СостояниеРеле", ТекущееСостояниеРеле, ДатаПолученияТекущегоСостояния); 
	
КонецПроцедуры

