
Функция НовыйКлючФоновогоЗадания() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Процессы.КлючФоновогоЗадания КАК КлючФоновогоЗадания
	               |ИЗ
	               |	РегистрСведений.Процессы КАК Процессы
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КлючФоновогоЗадания УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		КлючФоновогоЗадания = Выборка.КлючФоновогоЗадания + 1;
	Иначе
		КлючФоновогоЗадания = 1;
	КонецЕсли;
	
	Возврат КлючФоновогоЗадания; 
	
КонецФункции