
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		
		ПараметрыТелеграмГруппаСообщений = СводкаВложенийГруппы.Параметры.Элементы.Найти("ТелеграмГруппаСообщений");
		ПараметрыТелеграмГруппаСообщений.Значение = Объект.Ссылка;	
		ПараметрыТелеграмГруппаСообщений.Использование = Истина;
		
		
		ПараметрыТелеграмГруппаСообщений = СообщенияГруппы.Параметры.Элементы.Найти("ТелеграмГруппаСообщений");
		ПараметрыТелеграмГруппаСообщений.Значение = Объект.Ссылка;	
		ПараметрыТелеграмГруппаСообщений.Использование = Истина;
		
		
		ПараметрыТелеграмГруппаСообщений = СостоянияГруппы.Параметры.Элементы.Найти("ТелеграмГруппаСообщений");
		ПараметрыТелеграмГруппаСообщений.Значение = Объект.Ссылка;	
		ПараметрыТелеграмГруппаСообщений.Использование = Истина;	
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СообщенияГруппыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Регистратор);
	КонецЕсли;
	
КонецПроцедуры
