
Процедура ВыполнитьГруппуДействий(ЭлементСправочника) Экспорт
	
	ГруппаУсловийВыполняется = Истина;
	Если ЗначениеЗаполнено(ЭлементСправочника.ГруппаУсловий) Тогда 
		ГруппаУсловийВыполняется = СерверПривилегированный.ПроверкаГруппыУсловий(ЭлементСправочника.ГруппаУсловий);
	КонецЕсли;
	Если ГруппаУсловийВыполняется Тогда 
		Для Каждого Строка Из ЭлементСправочника.Действия Цикл
			ГруппаУсловийДействияВыполняется = Истина; 
			Если ЗначениеЗаполнено(Строка.ГруппаУсловий) Тогда
				ГруппаУсловийДействияВыполняется = СерверПривилегированный.ПроверкаГруппыУсловий(Строка.ГруппаУсловий);
            КонецЕсли;
			Если ГруппаУсловийДействияВыполняется Тогда	
				МассивСДействием = Новый Массив();
				МассивСДействием.Добавить(Строка.Действие);
				Если Строка.ОжидатьЗавершения Тогда		
					Справочники.Действия.ВыполнитьДействия(МассивСДействием);	
				Иначе
					МассивСПараметрамиДляДействий = Новый Массив();
					МассивСПараметрамиДляДействий.Добавить(МассивСДействием);
					ОбщегоНазначения.ВыполнитьПроцедуруФункциюВФонеНаСервере("Справочники.Действия.ВыполнитьДействия", МассивСПараметрамиДляДействий);	
				КонецЕсли;												
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;			
	
КонецПроцедуры