
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Шаг1ПолучитьКлючАПИИзСправочника();
	
КонецПроцедуры

//Страницы++
&НаСервере
Процедура Шаг1ПолучитьКлючАПИИзСправочника()
	
	Если ЗначениеЗаполнено(Справочники.ТелеграмПараметры.КлючAPI.Значение) Тогда 
		МастерКлючАПИ = Справочники.ТелеграмПараметры.КлючAPI.Значение;		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаШаг1 Тогда 
		Шаг1ПолучитьКлючАПИИзСправочника();
	//ИначеЕсли ТекущаяСтраница = Элементы.СтраницаШаг2 Тогда 
		
	КонецЕсли;
		
КонецПроцедуры

//Страницы--


//Шаг1++
&НаСервере
Процедура Шаг1ЗаписатьКлючАПИНаСервере()
	
	Параметр = Справочники.ТелеграмПараметры.КлючAPI.ПолучитьОбъект();
	Параметр.Значение = МастерКлючАПИ;
	Параметр.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Шаг1ЗаписатьКлючАПИ(Команда)
	Шаг1ЗаписатьКлючАПИНаСервере();
КонецПроцедуры


//Шаг1--
