
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Шаг1ПолучитьКлючАПИИзСправочника();
	
КонецПроцедуры

//Страницы++
&НаСервере
Процедура Шаг1ПолучитьКлючАПИИзСправочника()
	
	Если ЗначениеЗаполнено(Справочники.ТелеграмПараметры.КлючAPI.Значение) Тогда 
		МастерКлючАПИ = Справочники.ТелеграмПараметры.КлючAPI.Значение;		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаШаг1 Тогда 
		Шаг1ПолучитьКлючАПИИзСправочника();
	//ИначеЕсли ТекущаяСтраница = Элементы.СтраницаШаг2 Тогда 
		
	КонецЕсли;
		
КонецПроцедуры

//Страницы--


//Шаг1++
&НаСервере
Процедура Шаг1ЗаписатьКлючАПИНаСервере()
	
	Параметр = Справочники.ТелеграмПараметры.КлючAPI.ПолучитьОбъект();
	Параметр.Значение = МастерКлючАПИ;
	Параметр.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Шаг1ЗаписатьКлючАПИ(Команда)
	Шаг1ЗаписатьКлючАПИНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьПроцессыПоУмолчаниюНаСервере()
	//Создадим 4 Процесса
	
	Телеграм_ПолучитьНовыеСообщения = РегистрыСведений.Процессы.СоздатьМенеджерЗаписи();
	Телеграм_ПолучитьНовыеСообщения.Наименование = "Телеграм_ПолучитьНовыеСообщения";
	Телеграм_ПолучитьНовыеСообщения.РасположениеПроцедуры = "ТелеграмМодуль";
	Телеграм_ПолучитьНовыеСообщения.НазваниеПроцедуры = "ПолучитьНовыеСообщения";
	Телеграм_ПолучитьНовыеСообщения.Оборудование = Справочники.Оборудование.ТелеграмБот;
	Телеграм_ПолучитьНовыеСообщения.Включён = Истина;
	Телеграм_ПолучитьНовыеСообщения.МинИнтервалПослеСтарта = 0;
	Телеграм_ПолучитьНовыеСообщения.МинИнтервалПослеЗавершения = 1;
	Телеграм_ПолучитьНовыеСообщения.КлючФоновогоЗадания = РегистрыСведений.Процессы.НовыйКлючФоновогоЗадания();
	Телеграм_ПолучитьНовыеСообщения.Комментарий = "Процесс получает новые сообщение телеграм бота";
	Телеграм_ПолучитьНовыеСообщения.МаксимальноеВремяИтерации = 30;
	Телеграм_ПолучитьНовыеСообщения.Записать(Истина);
		
	Телеграм_ПовторнаяПроверкаЗагрузкаВложенийИОбработкаСообщений = РегистрыСведений.Процессы.СоздатьМенеджерЗаписи();
	Телеграм_ПовторнаяПроверкаЗагрузкаВложенийИОбработкаСообщений.Наименование = "Телеграм_ПовторнаяПроверкаЗагрузкаВложенийИОбработкаСообщений";
	Телеграм_ПовторнаяПроверкаЗагрузкаВложенийИОбработкаСообщений.РасположениеПроцедуры = "ТелеграмМодуль";
	Телеграм_ПовторнаяПроверкаЗагрузкаВложенийИОбработкаСообщений.НазваниеПроцедуры = "ПовторноПроверитьЗагрузитьВложенияИОбработатьНеОбработанныеВходящиеСообщений";
	Телеграм_ПовторнаяПроверкаЗагрузкаВложенийИОбработкаСообщений.Оборудование = Справочники.Оборудование.ТелеграмБот;
	Телеграм_ПовторнаяПроверкаЗагрузкаВложенийИОбработкаСообщений.Включён = Истина;
	Телеграм_ПовторнаяПроверкаЗагрузкаВложенийИОбработкаСообщений.МинИнтервалПослеСтарта = 0;
	Телеграм_ПовторнаяПроверкаЗагрузкаВложенийИОбработкаСообщений.МинИнтервалПослеЗавершения = 60;
	Телеграм_ПовторнаяПроверкаЗагрузкаВложенийИОбработкаСообщений.КлючФоновогоЗадания = РегистрыСведений.Процессы.НовыйКлючФоновогоЗадания();
	Телеграм_ПовторнаяПроверкаЗагрузкаВложенийИОбработкаСообщений.Комментарий = "Процесс проверят загружает вложения и обрабатывает входящие сообщения которые не получилось обработать при получении";
	Телеграм_ПовторнаяПроверкаЗагрузкаВложенийИОбработкаСообщений.МаксимальноеВремяИтерации = 0;
	Телеграм_ПовторнаяПроверкаЗагрузкаВложенийИОбработкаСообщений.Записать(Истина);
	
	Телеграм_ПовторнаяОбработкаПроверенныхЗагруженныхНеОбработанныхСообщений = РегистрыСведений.Процессы.СоздатьМенеджерЗаписи();
	Телеграм_ПовторнаяОбработкаПроверенныхЗагруженныхНеОбработанныхСообщений.Наименование = "Телеграм_ПовторнаяОбработкаПроверенныхЗагруженныхНеОбработанныхСообщений";
	Телеграм_ПовторнаяОбработкаПроверенныхЗагруженныхНеОбработанныхСообщений.РасположениеПроцедуры = "ТелеграмМодуль";
	Телеграм_ПовторнаяОбработкаПроверенныхЗагруженныхНеОбработанныхСообщений.НазваниеПроцедуры = "ПовторноОбработатьПроверенныеЗагруженныеНеОбработанныеСообщения";
	Телеграм_ПовторнаяОбработкаПроверенныхЗагруженныхНеОбработанныхСообщений.Оборудование = Справочники.Оборудование.ТелеграмБот;
	Телеграм_ПовторнаяОбработкаПроверенныхЗагруженныхНеОбработанныхСообщений.Включён = Истина;
	Телеграм_ПовторнаяОбработкаПроверенныхЗагруженныхНеОбработанныхСообщений.МинИнтервалПослеСтарта = 0;
	Телеграм_ПовторнаяОбработкаПроверенныхЗагруженныхНеОбработанныхСообщений.МинИнтервалПослеЗавершения = 60;
	Телеграм_ПовторнаяОбработкаПроверенныхЗагруженныхНеОбработанныхСообщений.КлючФоновогоЗадания = РегистрыСведений.Процессы.НовыйКлючФоновогоЗадания();
	Телеграм_ПовторнаяОбработкаПроверенныхЗагруженныхНеОбработанныхСообщений.Комментарий = "Процесс обрабатывает входящие проверенные/загруженные сообщения которые не получилось обработать при получении";
	Телеграм_ПовторнаяОбработкаПроверенныхЗагруженныхНеОбработанныхСообщений.МаксимальноеВремяИтерации = 0;
	Телеграм_ПовторнаяОбработкаПроверенныхЗагруженныхНеОбработанныхСообщений.Записать(Истина);

	Телеграм_ПовторнаяОтправкаНеОтправленныеИсходящиеСообщения = РегистрыСведений.Процессы.СоздатьМенеджерЗаписи();
	Телеграм_ПовторнаяОтправкаНеОтправленныеИсходящиеСообщения.Наименование = "Телеграм_ПовторнаяОтправкаНеОтправленныеИсходящиеСообщения";
	Телеграм_ПовторнаяОтправкаНеОтправленныеИсходящиеСообщения.РасположениеПроцедуры = "ТелеграмМодуль";
	Телеграм_ПовторнаяОтправкаНеОтправленныеИсходящиеСообщения.НазваниеПроцедуры = "ПовторноОтправитьНеОтправленныеИсходящиеСообщения";
	Телеграм_ПовторнаяОтправкаНеОтправленныеИсходящиеСообщения.Оборудование = Справочники.Оборудование.ТелеграмБот;
	Телеграм_ПовторнаяОтправкаНеОтправленныеИсходящиеСообщения.Включён = Истина;
	Телеграм_ПовторнаяОтправкаНеОтправленныеИсходящиеСообщения.МинИнтервалПослеСтарта = 0;
	Телеграм_ПовторнаяОтправкаНеОтправленныеИсходящиеСообщения.МинИнтервалПослеЗавершения = 60;
	Телеграм_ПовторнаяОтправкаНеОтправленныеИсходящиеСообщения.КлючФоновогоЗадания = РегистрыСведений.Процессы.НовыйКлючФоновогоЗадания();
	Телеграм_ПовторнаяОтправкаНеОтправленныеИсходящиеСообщения.Комментарий = "Процесс проверят загружает вложения и обрабатывает входящие сообщения которые не получилось обработать при получении";
	Телеграм_ПовторнаяОтправкаНеОтправленныеИсходящиеСообщения.МаксимальноеВремяИтерации = 0;
	Телеграм_ПовторнаяОтправкаНеОтправленныеИсходящиеСообщения.Записать(Истина);

	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПроцессыПоУмолчанию(Команда)
	СоздатьПроцессыПоУмолчаниюНаСервере();
КонецПроцедуры


//Шаг1--
