
Процедура ЗаписьВЖурналОшибок(ИмяМодуля, ИмяПроцедурыФункции, ОписаниеОшибки) Экспорт
	
	ОписаниеОшибки = ОписаниеОшибки + " ПользовательИД: " + Строка(ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор); 
	ДатаЗаписи = ТекущаяДата(); 
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
                  |	ЖурналОшибок.Описание
                  |ИЗ
                  |	РегистрСведений.ЖурналОшибок КАК ЖурналОшибок
                  |ГДЕ
                  |	ЖурналОшибок.Период = &Период
                  |	И ЖурналОшибок.ИмяМодуля = &ИмяМодуля
                  |	И ЖурналОшибок.ИмяПроцедурыФункции = &ИмяПроцедурыФункции";
				  
	Запрос.УстановитьПараметр("Период", ДатаЗаписи);
	Запрос.УстановитьПараметр("ИмяМодуля", ИмяМодуля);
	Запрос.УстановитьПараметр("ИмяПроцедурыФункции", ИмяПроцедурыФункции);
	Результат = Запрос.Выполнить();
	
	ЗаписьВЖурнал = РегистрыСведений.ЖурналОшибок.СоздатьМенеджерЗаписи();
	ЗаписьВЖурнал.Период = ДатаЗаписи;
	ЗаписьВЖурнал.ИмяМодуля = ИмяМодуля; 
	ЗаписьВЖурнал.ИмяПроцедурыФункции = ИмяПроцедурыФункции;
	Если Результат.Пустой() Тогда 	
		ЗаписьВЖурнал.Описание = ОписаниеОшибки;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ЗаписьВЖурнал.Описание = Выборка.Описание + Символы.ПС + "-------------------------" + Символы.ПС + ОписаниеОшибки;
    КонецЕсли;
	ЗаписьВЖурнал.Записать(Истина);
	
КонецПроцедуры
