
&НаСервере
Процедура ОткрытьПортНаСервере()	
	к.ОткрытьCOMПорт(НомерПортаАдрес, 115200);	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПорт(Команда)
	ОткрытьПортНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗакрытьПортНаСервере()
	к.ЗакрытьCOMПорт(НомерПортаАдрес);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПорт(Команда)
	ЗакрытьПортНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПерезапуститьСлужбуСервераНаСервере()
	К.ПерезапуститьАгентСервера1С();
КонецПроцедуры


&НаКлиенте
Процедура ПерезапуститьСлужбуСервера(Команда)
	ПерезапуститьСлужбуСервераНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПерезагрузитьСерверНаСервере()
	К.ПерезагрузитьСервер1С();
КонецПроцедуры


&НаКлиенте
Процедура ПерезагрузитьСервер(Команда)
	ПерезагрузитьСерверНаСервере();
КонецПроцедуры


&НаСервере
Процедура ОтправитьКомандуНаСервере()
	Ответ = К.ВыполнитьКоманду(НомерПортаАдрес, НомерПина, НомерКоманды, Аргумент, ДопАргумент);
	ОтветСтатус = Ответ.ОтветСтатус;
	ОтветАргумент1 = Ответ.ОтветАргумент1;
    ОтветАргумент2 = Ответ.ОтветАргумент2;
	ОтветДопАргумент = Ответ.ОтветДопАргументNET; 
	КомандаВыполнена = Ответ.КомандаВыполнена;
	Ошибка = Ответ.Ошибка;

КонецПроцедуры


&НаКлиенте
Процедура ОтправитьКоманду(Команда)
	ОтправитьКомандуНаСервере();
КонецПроцедуры


&НаСервере
Процедура HIGHНаСервере()
	К._pinModeOUTPUT_digitalWrite(НомерПортаАдрес, НомерПинаГруппа3, 1);
КонецПроцедуры


&НаКлиенте
Процедура HIGH(Команда)
	HIGHНаСервере();
КонецПроцедуры


&НаСервере
Процедура LOWНаСервере()
	К._pinModeOUTPUT_digitalWrite(НомерПортаАдрес, НомерПинаГруппа3, 0);
КонецПроцедуры


&НаКлиенте
Процедура LOW(Команда)
	LOWНаСервере();
КонецПроцедуры


&НаСервере
Процедура LOW1НаСервере()
	К._pinModeOUTPUT_digitalWrite(НомерПортаАдрес, НомерПинаГруппа4, 0);
КонецПроцедуры


&НаКлиенте
Процедура LOW1(Команда)
	LOW1НаСервере();
КонецПроцедуры


&НаСервере
Процедура HIGH1НаСервере()
	К._pinModeOUTPUT_digitalWrite(НомерПортаАдрес, НомерПинаГруппа4, 1);
КонецПроцедуры


&НаКлиенте
Процедура HIGH1(Команда)
	HIGH1НаСервере();
КонецПроцедуры


&НаСервере
Процедура digitalReadНаСервере()
	ОтветГруппа5 = К._pinModeINPUT_digitalRead(НомерПортаАдрес, НомерПинаГруппа5);
КонецПроцедуры


&НаКлиенте
Процедура digitalRead(Команда)
	digitalReadНаСервере();
КонецПроцедуры


&НаСервере
Процедура LOW2НаСервере()
	К._pinModeOUTPUT_digitalWrite(НомерПортаАдрес, НомерПинаГруппа6, 0);
КонецПроцедуры


&НаКлиенте
Процедура LOW2(Команда)
	LOW2НаСервере();
КонецПроцедуры


&НаСервере
Процедура HIGH2НаСервере()
	К._pinModeOUTPUT_digitalWrite(НомерПортаАдрес, НомерПинаГруппа6, 1);
КонецПроцедуры


&НаКлиенте
Процедура HIGH2(Команда)
	HIGH2НаСервере();
КонецПроцедуры


&НаСервере
Процедура LOW3НаСервере()
	К._pinModeOUTPUT_digitalWrite(НомерПортаАдрес, НомерПинаГруппа7, 0);
КонецПроцедуры


&НаКлиенте
Процедура LOW3(Команда)
	LOW3НаСервере();
КонецПроцедуры


&НаСервере
Процедура HIGH3НаСервере()
	К._pinModeOUTPUT_digitalWrite(НомерПортаАдрес, НомерПинаГруппа7, 1);	
КонецПроцедуры


&НаКлиенте
Процедура HIGH3(Команда)
	HIGH3НаСервере();
КонецПроцедуры


&НаСервере
Процедура analogReadНаСервере()
	ОтветГруппа8 = К.analogRead(НомерПортаАдрес, НомерПинаГруппа8);
КонецПроцедуры


&НаКлиенте
Процедура analogRead(Команда)
	analogReadНаСервере();
КонецПроцедуры


&НаСервере
Процедура analogWrite9НаСервере()
	К.analogWrite(НомерПортаАдрес, НомерПинаГруппа9, Аргумент9);
КонецПроцедуры


&НаКлиенте
Процедура analogWrite9(Команда)
	analogWrite9НаСервере();
КонецПроцедуры


&НаКлиенте
Процедура Аргумент10ПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("Аргумент10ПриИзмененииНаКлиенте",1,Истина);
КонецПроцедуры
&НаКлиенте
Процедура Аргумент10ПриИзмененииНаКлиенте()
	
	Аргумент10ПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура Аргумент10ПриИзмененииНаСервере()
	
	ЗаписатьКомандуanalogWriteВРегистрСведений(НомерПинаГруппа10, Аргумент10);
	
КонецПроцедуры

Процедура ЗаписатьКомандуanalogWriteВРегистрСведений(нПина, чАргумент)
	
	Если ТипЗнч(НомерПортаАдрес) = Тип("Число") Тогда // Команда в COM порт
		Менеджер = РегистрыСведений.COM.СоздатьМенеджерЗаписи();
		Менеджер.НомерCOMПорта = НомерПортаАдрес;
	ИначеЕсли ТипЗнч(НомерПортаАдрес) = Тип("Строка") Тогда // Команда на сетевой адрес
		Менеджер = РегистрыСведений.NET.СоздатьМенеджерЗаписи();
		Менеджер.АдресПорт = НомерПортаАдрес;
	Иначе
		Возврат;
	КонецЕсли;
	
		
		Менеджер.НомерПина = нПина;
		Менеджер.Команда = 4;
		Менеджер.Аргумент = чАргумент;	
		Менеджер.Записать(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Аргумент11ПриИзменении(Элемент)
	Аргумент11ПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура Аргумент11ПриИзмененииНаСервере()
	
	ЗаписатьКомандуanalogWriteВРегистрСведений(НомерПинаГруппа11, Аргумент11);

КонецПроцедуры

&НаКлиенте
Процедура Аргумент12ПриИзменении(Элемент)
	Аргумент12ПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура Аргумент12ПриИзмененииНаСервере()
	ЗаписатьКомандуanalogWriteВРегистрСведений(НомерПинаГруппа12, Аргумент12);
КонецПроцедуры


