
Процедура ПроцессДляСервера(Процесс = "") Экспорт // Записывается в процессы НазваниеПроцедуры
	
	Инициализация();	
	СохранитьСнимок();	
	
КонецПроцедуры

Функция ПолучитьДвоичныеДанныеФотографии() Экспорт
	
	Инициализация();	
	ДвоичныеДанныеФото = ПолучитьФотоВнутренняя();	
	
	Возврат ДвоичныеДанныеФото;
	
КонецФункции



//////////////////////////////////////////////
Процедура Инициализация() 
	
	АдресКамеры = Оборудование.КонтроллерCOMNET.АдресПорт;
	
	Ответ = ЗаполнитьНастройки();
	Если ЗначениеЗаполнено(Ответ) Тогда 
		Сообщения = Сообщения + Символы.ПС + ТекущаяДата() + " " + Ответ;
	КонецЕсли;

	
КонецПроцедуры

Функция  ЗаполнитьНастройки()
	
	СообщениеСНенайденнымиНастройками = "";
	
	// Настройки в реквизитах
	СтрокаСТабСНастройкамиРеквизитов = Оборудование.Настройки.Найти("Реквизиты",  "Наименование");
	Если СтрокаСТабСНастройкамиРеквизитов = Неопределено Тогда 
		СообщениеСНенайденнымиНастройками = СообщениеСНенайденнымиНастройками + "Не заполнена настройка для реквизитов (В справочнике оборудование); ";
	Иначе
		ТабСНастройкамиРеквизитов = СтрокаСТабСНастройкамиРеквизитов.Настройка.ТаблицаНастроек;
				
		СтрокаСПараметром = ТабСНастройкамиРеквизитов.Найти("HTTPКомандаОтправляемаяПередПолучениемФото", "Параметр");
		Если СтрокаСПараметром = Неопределено Тогда 
			//Ничего не делаем, команда не обязательна
		Иначе
			HTTPКомандаОтправляемаяПередПолучениемФото = СтрокаСПараметром.Значение;
		КонецЕсли;

		СтрокаСПараметром = ТабСНастройкамиРеквизитов.Найти("ЗапросПолученияФотоПоHTTP", "Параметр");
		Если СтрокаСПараметром = Неопределено Тогда 
			СообщениеСНенайденнымиНастройками = СообщениеСНенайденнымиНастройками + "Не указан параметр ""ЗапросПолученияФотоПоHTTP""; ";
		Иначе
			ЗапросПолученияФотоПоHTTP = СтрокаСПараметром.Значение;
		КонецЕсли;

		СтрокаСПараметром = ТабСНастройкамиРеквизитов.Найти("ПутьДляХраненияФотографийВРабочейПапке", "Параметр");
		Если СтрокаСПараметром = Неопределено Тогда 
			СообщениеСНенайденнымиНастройками = СообщениеСНенайденнымиНастройками + "Не указан параметр ""ПутьДляХраненияФотографийВРабочейПапке""; ";
		Иначе
			ПутьДляХраненияФотографийВРабочейПапке = СтрокаСПараметром.Значение;
		КонецЕсли;

		СтрокаСПараметром = ТабСНастройкамиРеквизитов.Найти("Логин", "Параметр");
		Если СтрокаСПараметром = Неопределено Тогда 
			//Ничего не делаем, команда не обязательна
		Иначе
			Логин = СтрокаСПараметром.Значение;
		КонецЕсли;
		
		СтрокаСПараметром = ТабСНастройкамиРеквизитов.Найти("Пароль", "Параметр");
		Если СтрокаСПараметром = Неопределено Тогда 
			//Ничего не делаем, команда не обязательна
		Иначе
			Пароль = СтрокаСПараметром.Значение;
		КонецЕсли;
		
		СтрокаСПараметром = ТабСНастройкамиРеквизитов.Найти("Порт", "Параметр");
		Если СтрокаСПараметром = Неопределено Тогда 
			//Ничего не делаем, команда не обязательна
		Иначе
			Порт = СтрокаСПараметром.Значение;
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат СообщениеСНенайденнымиНастройками;
	

КонецФункции


Процедура СохранитьСнимок()
	
	ДатаСнимка = ТекущаяДата();
	ГодСнимка = Формат(ДатаСнимка, "ДФ=yyyy");
	ГодМесяцДеньСнимка = Формат(ДатаСнимка, "ДФ=yyyy-MM-dd");
	ГодМесяцДеньЧасМинутаСекундаСнимка = Формат(ДатаСнимка, "ДФ=yyyy-MM-dd-HH-mm-ss");
	РабПапка = Константы.КаталогФайловРабочий.Получить();
	
	ПутьДляКаталогаФото = "" + РабПапка + ПутьДляХраненияФотографийВРабочейПапке + "\" + ГодМесяцДеньСнимка;
	ПутьДляФайлаФотоБезРасширения = "" + РабПапка + ПутьДляХраненияФотографийВРабочейПапке + "\" + ГодМесяцДеньСнимка + "\" + ГодМесяцДеньЧасМинутаСекундаСнимка;
	ПутьДляФайлаФотоСРасширением = ПутьДляФайлаФотоБезРасширения + ".jpg";
	
	СоздатьКаталог(ПутьДляКаталогаФото); 	
	ФайлФото = Новый Файл(ПутьДляФайлаФотоСРасширением);
	н = 1;
	Пока ФайлФото.Существует() Цикл 
		ПутьДляФайлаФотоСРасширением = ПутьДляФайлаФотоБезРасширения + "_" + н + ".jpg"; 
		ФайлФото = Новый Файл(ПутьДляФайлаФотоСРасширением);
		н = н + 1;
	КонецЦикла;;

	Ответ2 = ПолучитьФотоВнутренняя();	
	Фотография = Новый Картинка(Ответ2);
	Фотография.Записать(ПутьДляФайлаФотоСРасширением);
	
	
КонецПроцедуры

Функция ПолучитьФотоВнутренняя() 
	
	Соединение = Новый HTTPСоединение(АдресКамеры,?(ЗначениеЗаполнено(Порт), Порт, Неопределено),?(ЗначениеЗаполнено(Логин), Логин, Неопределено),?(ЗначениеЗаполнено(Пароль), Пароль, Неопределено),,5);
	
	Если HTTPКомандаОтправляемаяПередПолучениемФото <> "" Тогда
		Запрос1 = Новый HTTPЗапрос(HTTPКомандаОтправляемаяПередПолучениемФото); 	
		HTTPОтвет1 = Соединение.Получить(Запрос1);
	КонецЕсли;
	
	Запрос2 = Новый HTTPЗапрос(ЗапросПолученияФотоПоHTTP); 	
	HTTPОтвет2 = Соединение.Получить(Запрос2);	
	Ответ2 = HTTPОтвет2.ПолучитьТелоКакДвоичныеДанные();

	Возврат Ответ2;
	
КонецФункции

