
Процедура ПередЗаписью(Отказ)
	
	//Првоерим уникальность IP адреса если он заполнен
	
	Если ЗначениеЗаполнено(АдресПорт) Тогда
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	КонтроллерыNET.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.КонтроллерыNET КАК КонтроллерыNET
		               |ГДЕ
		               |	КонтроллерыNET.АдресПорт = &АдресПорт
		               |	И КонтроллерыNET.Ссылка <> &Ссылка";
		Запрос.УстановитьПараметр("АдресПорт", АдресПорт);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			Отказ = Истина;	
			Сообщить("Значение АдресПорт не уникально");
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.IPУстройства") Тогда
		// Заполнение шапки
		АдресПорт = ДанныеЗаполнения.IPАдрес;
		Наименование = ДанныеЗаполнения.Наименование;
		IPУстройство = ДанныеЗаполнения.Ссылка;
		Описание = ДанныеЗаполнения.Описание; 
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
