
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ТелеграмСообщения.Записывать = Истина;
	ДвижениеРСТС = Движения.ТелеграмСообщения.Добавить();
	ДвижениеРСТС.ДатаСообщения = Дата;
	ДвижениеРСТС.Сообщение = Ссылка;
	ДвижениеРСТС.Текст = Текст;
	ДвижениеРСТС.ТелеграмКонтакт = ТелеграмКонтакт;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТелеграмГруппыСообщенийСостояниеСрезПоследних.ТелеграмГруппаСообщений
	               |ИЗ
	               |	РегистрСведений.ТелеграмГруппыСообщенийСостояние.СрезПоследних(&Период, ТелеграмГруппаСообщений.ТелеграмКонтакт = &ТелеграмКонтакт) КАК ТелеграмГруппыСообщенийСостояниеСрезПоследних
	               |ГДЕ
	               |	ТелеграмГруппыСообщенийСостояниеСрезПоследних.Открыта
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТелеграмГруппыСообщенийСостояниеСрезПоследних.Период УБЫВ";
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("ТелеграмКонтакт", ТелеграмКонтакт);
	Результат = Запрос.Выполнить();	
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();	
		Пока Выборка.Следующий() Цикл			
			Движения.ТелеграмСообщенияГруппыСообщений.Записывать = Истина;
			Вложения = ОпределитьТипыИКоличествоВложений();
			Для Каждого Вложение Из Вложения Цикл
				ДвижениеРНТСГС = Движения.ТелеграмСообщенияГруппыСообщений.Добавить();
				ДвижениеРНТСГС.Период = Дата;
				ДвижениеРНТСГС.ТелеграмГруппаСообщений = Выборка.ТелеграмГруппаСообщений;
			    ДвижениеРНТСГС.ТипВложения = Вложение.Тип;
				ДвижениеРНТСГС.Количество = Вложение.Количество;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ОпределитьТипыИКоличествоВложений()
	
	Ответ = Новый ТаблицаЗначений();
	Ответ.Колонки.Добавить("Тип", Новый ОписаниеТипов("Строка"));
	Ответ.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	
	СтрокиПервогоУровня = СодержаниеСообщения.НайтиСтроки(Новый Структура("ИДРодителя", 0));
	Для Каждого Строка Из СтрокиПервогоУровня Цикл
		Если Строка.Ключ = "text" Тогда
			нСтрОтвет = Ответ.Добавить();
			нСтрОтвет.Тип = "text";
			нСтрОтвет.Количество = 1;			
		КонецЕсли;		
		Если Строка.Ключ = "photo" Тогда
			нСтрОтвет = Ответ.Добавить();
			нСтрОтвет.Тип = "photo";
			нСтрОтвет.Количество = 1;			
		КонецЕсли;	
		Если Строка.Ключ = "video" Тогда
			нСтрОтвет = Ответ.Добавить();
			нСтрОтвет.Тип = "video";
			нСтрОтвет.Количество = 1;			
		КонецЕсли;	
		Если Строка.Ключ = "document" Тогда
			нСтрОтвет = Ответ.Добавить();
			нСтрОтвет.Тип = "document";
			нСтрОтвет.Количество = 1;			
		КонецЕсли;	
		Если Строка.Ключ = "audio" Тогда
			нСтрОтвет = Ответ.Добавить();
			нСтрОтвет.Тип = "audio";
			нСтрОтвет.Количество = 1;			
		КонецЕсли;	
		Если Строка.Ключ = "voice" Тогда
			нСтрОтвет = Ответ.Добавить();
			нСтрОтвет.Тип = "voice";
			нСтрОтвет.Количество = 1;			
		КонецЕсли;
		Если Строка.Ключ = "sticker" Тогда
			нСтрОтвет = Ответ.Добавить();
			нСтрОтвет.Тип = "sticker";
			нСтрОтвет.Количество = 1;			
		КонецЕсли;
	КонецЦикла;
	
	Ответ.Свернуть("Тип", "Количество");
	
	Возврат Ответ;
	
КонецФункции


