
&НаКлиенте
Процедура ОчиститьУникальныйИдентификатор(Команда)
	Запись.УникальныйИдентификатор = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьНовыйУникальныйИдентификатор(Команда)
	Запись.УникальныйИдентификатор = Новый УникальныйИдентификатор();
КонецПроцедуры

&НаСервере
Процедура ПолучитьНовыйКлючФоновогоЗаданияНаСервере()
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Процессы.КлючФоновогоЗадания КАК КлючФоновогоЗадания
	               |ИЗ
	               |	РегистрСведений.Процессы КАК Процессы
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КлючФоновогоЗадания УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Запись.КлючФоновогоЗадания = Выборка.КлючФоновогоЗадания + 1;
	Иначе
		Запись.КлючФоновогоЗадания = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьНовыйКлючФоновогоЗадания(Команда)
	ПолучитьНовыйКлючФоновогоЗаданияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОстановитьТекущееФоновоеЗаданиеНаСервере()
	
	НайденноеФонЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Запись.УникальныйИдентификатор);
	Если НайденноеФонЗадание <> Неопределено Тогда 
		НайденноеФонЗадание.Отменить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОстановитьТекущееФоновоеЗадание(Команда)
	ОстановитьТекущееФоновоеЗаданиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОднократноСПроверкойУсловийНаСервере()
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Наименование", Запись.Наименование);
	Для Каждого Поле Из Метаданные.РегистрыСведений.Процессы.Ресурсы Цикл
		СтруктураПараметров.Вставить(Поле.Имя, Запись[Поле.Имя]);
	КонецЦикла;
	
	СерверПривилегированный.ОбработкаПроцессаДляСтарта(СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОднократноСПроверкойУсловий(Команда)
	ВыполнитьОднократноСПроверкойУсловийНаСервере();
КонецПроцедуры
