
&НаСервере
Процедура ВыполнитьНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПроцессДляСервера(); 
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьИтерацию(Команда)
	ВыполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоказанияНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ОбновитьПоказанияМодульОбъекта(); 
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоказания(Команда)
	ОбновитьПоказанияНаСервере();
КонецПроцедуры

&НаСервере
Процедура Реле1ВклНаСервере()
	К._pinModeOUTPUT_digitalWrite(?( ТипЗнч(Объект.Оборудование.КонтроллерCOMNET) = Тип("СправочникСсылка.КонтроллерыCOM"), Объект.Оборудование.КонтроллерCOMNET.НомерCOMПорта, Объект.Оборудование.КонтроллерCOMNET.АдресПорт) ,Объект.ПинРеле1НагревательОсновной, ?(Объект.Реле1Вкл, 1, 0));	
КонецПроцедуры

&НаКлиенте
Процедура Реле1Вкл(Команда)
	Реле1ВклНаСервере();
КонецПроцедуры

&НаСервере
Процедура Реле2ВклНаСервере()
	К._pinModeOUTPUT_digitalWrite(?( ТипЗнч(Объект.Оборудование.КонтроллерCOMNET) = Тип("СправочникСсылка.КонтроллерыCOM"), Объект.Оборудование.КонтроллерCOMNET.НомерCOMПорта, Объект.Оборудование.КонтроллерCOMNET.АдресПорт) ,Объект.ПинРеле2НагревательДополнительный, ?(Объект.Реле2Вкл, 1, 0));	
КонецПроцедуры

&НаКлиенте
Процедура Реле2Вкл(Команда)
	Реле2ВклНаСервере();
КонецПроцедуры

&НаСервере
Процедура Реле3ВклНаСервере()
	К._pinModeOUTPUT_digitalWrite(?( ТипЗнч(Объект.Оборудование.КонтроллерCOMNET) = Тип("СправочникСсылка.КонтроллерыCOM"), Объект.Оборудование.КонтроллерCOMNET.НомерCOMПорта, Объект.Оборудование.КонтроллерCOMNET.АдресПорт) ,Объект.ПинРеле3НагревательАКБ, ?(Объект.Реле3Вкл, 1, 0));	
КонецПроцедуры

&НаКлиенте
Процедура Реле3Вкл(Команда)
	Реле3ВклНаСервере();
КонецПроцедуры

&НаСервере
Процедура Реле4ВклНаСервере()
	К._pinModeOUTPUT_digitalWrite(?( ТипЗнч(Объект.Оборудование.КонтроллерCOMNET) = Тип("СправочникСсылка.КонтроллерыCOM"), Объект.Оборудование.КонтроллерCOMNET.НомерCOMПорта, Объект.Оборудование.КонтроллерCOMNET.АдресПорт) ,Объект.ПинРеле4Свет, ?(Объект.Реле4Вкл, 1, 0));	
КонецПроцедуры

&НаКлиенте
Процедура Реле4Вкл(Команда)
	Реле4ВклНаСервере();      
КонецПроцедуры

&НаСервере
Процедура ИнициализацияНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.Инициализация(); 
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура Инициализация(Команда)
	ИнициализацияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьТекущиеДанныеНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПолучитьТекущиеДанные(); 
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТекущиеДанные(Команда)
	ПолучитьТекущиеДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройкиИзСправочникаНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Ответ = ОбработкаОбъект.ЗаполнитьНастройки(); 
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	Если ЗначениеЗаполнено(Ответ) Тогда 
		Объект.Сообщения = Объект.Сообщения + Символы.ПС + ТекущаяДата() + " " + Ответ;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьНастройкиИзСправочника(Команда)
	ПрочитатьНастройкиИзСправочникаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзменениеНастройкиНаСервере(ИмяРеквизита)
	НайстрокаВСправочнике = Объект.Оборудование.Настройки.Найти("Реквизиты", "Наименование");
	Если НайстрокаВСправочнике <> Неопределено Тогда 
		НастройкаОбъект = НайстрокаВСправочнике.Настройка.ПолучитьОбъект();		
		ТабНастроек = НастройкаОбъект.ТаблицаНастроек;		
		СтрСПараметром = ТабНастроек.Найти(ИмяРеквизита, "Параметр");
		Если СтрСПараметром = Неопределено Тогда //Добавляем
			СтрСПараметром = ТабНастроек.Добавить();
			СтрСПараметром.Параметр = ИмяРеквизита;
		КонецЕсли;
		СтрСПараметром.Значение = Объект[ИмяРеквизита];
		НастройкаОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзменениеНастройки(Элемент)
	ЗаписатьИзменениеНастройкиНаСервере(Элемент.Имя);
КонецПроцедуры
