
&НаСервере
Процедура ПолучитьНовыйКлючНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ключ) Тогда  
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Настройки.Ключ КАК Ключ
		               |ИЗ
		               |	Справочник.Настройки КАК Настройки
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Ключ УБЫВ";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			Объект.Ключ = Выборка.Ключ + 1;
		Иначе
			Объект.Ключ = 1;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьНовыйКлюч(Команда)
	ПолучитьНовыйКлючНаСервере();
КонецПроцедуры
