
Функция ПолучитьДокСообщенияПоИД(СообщениеИД) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТелеграмСообщенияИсходящиеОтправленные.Сообщение КАК Сообщение
	               |ИЗ
	               |	РегистрСведений.ТелеграмСообщенияИсходящиеОтправленные КАК ТелеграмСообщенияИсходящиеОтправленные
	               |ГДЕ
	               |	ТелеграмСообщенияИсходящиеОтправленные.СообщениеИД = &СообщениеИД";
	Запрос.УстановитьПараметр("СообщениеИД", СообщениеИД);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Сообщение;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции
