
//СсылкиНаЭлементыСправочника - Массив с сылками
Функция ВыполнитьДействия(СсылкиНаЭлементыСправочника) Экспорт
	
	ОбщиеОтветы = Новый ТаблицаЗначений();
	ОбщиеОтветы.Колонки.Добавить("СсылкаНаДействие");
	ОбщиеОтветы.Колонки.Добавить("Ответы");
	
	Для Каждого СсылкаНаЭлементСправочника Из СсылкиНаЭлементыСправочника Цикл
		
		Если СсылкаНаЭлементСправочника.ОбработкаДоОтправкиКомандАктивна = Истина 
			или ЗначениеЗаполнено(СсылкаНаЭлементСправочника.Оборудование)
			или СсылкаНаЭлементСправочника.ОбработкаПослеОтправкиКомандАктивна = Истина Тогда
				//Отметка о старте
				ДатаСтарта = ТекущаяДата();
				ЗаписьВРегистр = РегистрыСведений.ВыполненныеДействия.СоздатьМенеджерЗаписи();
				ЗаписьВРегистр.Период = ДатаСтарта;
				ЗаписьВРегистр.Действие = СсылкаНаЭлементСправочника.Ссылка;
				ЗаписьВРегистр.Записать(Истина);
		КонецЕсли;
		
		
		Оборудование = СсылкаНаЭлементСправочника.Оборудование; 
			
		Если СсылкаНаЭлементСправочника.ОбработкаДоОтправкиКомандАктивна = Истина Тогда 
			Выполнить(СсылкаНаЭлементСправочника.ВыполняемаяОбработкаДоОтправкиКоманд);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СсылкаНаЭлементСправочника.Оборудование) Тогда // Отсеиваем группы и элементы с незаполненым оборудованием
			
			Ответы = Новый Структура();
			Для Каждого Команда Из СсылкаНаЭлементСправочника.ОтправляемыеКоманды Цикл
				Если Команда.ОжидатьЗавершенияКоманды Тогда
					Ответ = К.ВыполнитьКоманду(СсылкаНаЭлементСправочника.Оборудование, Команда.НомерПина, Команда.Команда, Команда.Аргумент, Команда.ДопАргументNET);
					Ответы.Вставить("Команда" + Команда.НомерСтроки,Ответ);
				Иначе
					МассивПараметровДляКоманды = Новый Массив();
					МассивПараметровДляКоманды.Добавить(СсылкаНаЭлементСправочника.Оборудование);
					МассивПараметровДляКоманды.Добавить(Команда.НомерПина);
					МассивПараметровДляКоманды.Добавить(Команда.Команда);
					МассивПараметровДляКоманды.Добавить(Команда.Аргумент);
					МассивПараметровДляКоманды.Добавить(Команда.ДопАргументNET);
					ОбщегоНазначения.ВыполнитьПроцедуруФункциюВФонеНаСервере("К.ВыполнитьКоманду", МассивПараметровДляКоманды); 
					Ответы.Вставить("Команда" + Команда.НомерСтроки,"Ожидание завершения команды выключено");
				КонецЕсли;
			КонецЦикла;
						
			СтрОбщихОтветов = ОбщиеОтветы.Добавить();
			СтрОбщихОтветов.СсылкаНаДействие = СсылкаНаЭлементСправочника;
			СтрОбщихОтветов.Ответы = Ответы;
		КонецЕсли;
		
		Если СсылкаНаЭлементСправочника.ОбработкаПослеОтправкиКомандАктивна = Истина Тогда 
			Выполнить(СсылкаНаЭлементСправочника.ВыполняемаяОбработкаПослеОтправкиКоманд);
		КонецЕсли;
		
		
		Если СсылкаНаЭлементСправочника.ОбработкаДоОтправкиКомандАктивна = Истина 
			или ЗначениеЗаполнено(СсылкаНаЭлементСправочника.Оборудование)
			или СсылкаНаЭлементСправочника.ОбработкаПослеОтправкиКомандАктивна = Истина Тогда
				ЗаписьВРегистр.ДатаЗавершения = ТекущаяДата();
				ЗаписьВРегистр.Записать(Истина);
		КонецЕсли;

	КонецЦикла;
	
	Возврат СтрОбщихОтветов;
	
КонецФункции
