
Функция ВыполнитьДействие() Экспорт
	
	Если ОбработкаДоОтправкиКомандАктивна = Истина 
		или ЗначениеЗаполнено(Оборудование)
		или ОбработкаПослеОтправкиКомандАктивна = Истина Тогда
			//Отметка о старте
			ДатаСтарта = ТекущаяДата();
			ЗаписьВРегистр = РегистрыСведений.ВыполненныеДействия.СоздатьМенеджерЗаписи();
			ЗаписьВРегистр.Период = ДатаСтарта;
			ЗаписьВРегистр.Действие = Ссылка;
			ЗаписьВРегистр.Записать(Истина);
	КонецЕсли;

	
	Если ОбработкаДоОтправкиКомандАктивна = Истина Тогда 
		Выполнить(ВыполняемаяОбработкаДоОтправкиКоманд);
	КонецЕсли;

		
	Ответы = Новый Структура();
	Если ЗначениеЗаполнено(Оборудование) Тогда 
		Для Каждого Команда Из ОтправляемыеКоманды Цикл
			Если Команда.ОжидатьЗавершенияКоманды Тогда
				Ответ = К.ВыполнитьКоманду(Оборудование, Команда.НомерПина, Команда.Команда, Команда.Аргумент, Команда.ДопАргументNET);
				Ответы.Вставить("Команда" + Команда.НомерСтроки,Ответ);
			Иначе
				МассивПараметровДляКоманды = Новый Массив();
				МассивПараметровДляКоманды.Добавить(Оборудование);
				МассивПараметровДляКоманды.Добавить(Команда.НомерПина);
				МассивПараметровДляКоманды.Добавить(Команда.Команда);
				МассивПараметровДляКоманды.Добавить(Команда.Аргумент);
				МассивПараметровДляКоманды.Добавить(Команда.ДопАргументNET);
				ОбщегоНазначения.ВыполнитьПроцедуруФункциюВФонеНаСервере("К.ВыполнитьКоманду", МассивПараметровДляКоманды); 
				Ответы.Вставить("Команда" + Команда.НомерСтроки,"Ожидание завершения команды выключено");				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ОбработкаПослеОтправкиКомандАктивна = Истина Тогда 
		Выполнить(ВыполняемаяОбработкаПослеОтправкиКоманд);
	КонецЕсли;

	
	Если ОбработкаДоОтправкиКомандАктивна = Истина 
		или ЗначениеЗаполнено(Оборудование)
		или ОбработкаПослеОтправкиКомандАктивна = Истина Тогда
			ЗаписьВРегистр.ДатаЗавершения = ТекущаяДата();
			ЗаписьВРегистр.Записать(Истина);
	КонецЕсли;
		

	Возврат Ответы;
	
КонецФункции
