
&НаКлиенте
Процедура ФайлПутьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
			
	ДиалогФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);			
	Продолжение = Новый ОписаниеОповещения("Продолжение", ЭтотОбъект);
	ДиалогФайла.Показать(Продолжение);
		
КонецПроцедуры

&НаСервере
Процедура ЗаписатьФайлВХранилищеНаСервере(ПереноснойФайлОбработки, КомментарийКФайлуИсточнику)
	
	ДанныеОбъект=РеквизитФормыВЗначение("Объект");
	ДанныеОбъект.ФайлОбработки=Новый ХранилищеЗначения(ПереноснойФайлОбработки);
	ДанныеОбъект.КомментарийКФайлуИсточнику = КомментарийКФайлуИсточнику;
	ДанныеОбъект.Записать();
	ЗначениеВРеквизитФормы(ДанныеОбъект,"Объект");
	
		
КонецПроцедуры


&НаКлиенте
Процедура Продолжение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда  
			ПолноеИмяФайлаОбработки = ВыбранныеФайлы[0];				
			Файл = Новый Файл(ПолноеИмяФайлаОбработки);
			КомментарийКФайлуИсточнику = Файл.Имя + " сохранен в ИБ:" + ТекущаяДата();
			ФайлПуть = КомментарийКФайлуИсточнику;
			ПереноснойФайлОбработки = Новый ДвоичныеДанные(ПолноеИмяФайлаОбработки);
			ЗаписатьФайлВХранилищеНаСервере(ПереноснойФайлОбработки, КомментарийКФайлуИсточнику);
    Иначе
        Сообщить("Файл не выбран!");
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	ДанныеОбъект=РеквизитФормыВЗначение("Объект");
	ОбработкаЕсть = ЗначениеЗаполнено(ДанныеОбъект.ФайлОбработки.получить());
	ЗначениеВРеквизитФормы(ДанныеОбъект,"Объект");	
	Если ОбработкаЕсть Тогда 
		ФайлПуть = "Файл в базе";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры
